MAXFELIXDIY/esp32-s3-1-54IPS-gadget/radio/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# 8 MB octal PSRAM (ESP32-S3 R8)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Wi-Fi буфери в PSRAM, щоб зекономити внутрішню RAM
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# TLS-буфери у PSRAM (інакше не вистачає внутрішньої RAM)
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
